{"flatpakAppId":"beneath-a-steel-sky.desktop","name":"Beneath A Steel Sky","summary":"A science-fiction adventure game set in a bleak post-apocalyptic vision of the future","description":"\n    <p>A science-fiction thriller set in a bleak post-apocalyptic vision of the future, Beneath a Steel Sky revolves around \"Union City\", where selfishness, rivalry, and corruption by its citizens seems to be all too common, those who can afford it live underground, away from the pollution and social problems which are plaguing the city.</p>\n    <p>You take on the role of Robert Foster, an outcast of sorts from the city since a boy who was raised in a remote environment outside of Union City simply termed \"the gap\".  Robert's mother took him away from Union City as a child on their way to \"Hobart\" but the helicopter crashed on its way, unfortunately Robert's mother dies, but he survives and is left to be raised by a local tribe from the gap.</p>\n    <p>Years later, Union City security drops by and abducts Robert, killing his tribe in the process; upon reaching the city the helicopter taking him there crashes with him escaping, high upon a tower block in the middle of the city he sets out to discover the truth about his past, and to seek vengeance for the killing of his tribe.</p>\n    <p>Note that this package only contains game-data.  The game engine is provided by ScummVM.</p>\n  ","developerName":null,"projectLicense":null,"homepageUrl":null,"donationUrl":null,"translateUrl":null,"bugtrackerUrl":null,"helpUrl":null,"categories":[{"name":"AdventureGame"},{"name":"Game"},{"name":"RolePlaying"}],"downloadFlatpakRefUrl":"beneath-a-steel-sky","currentReleaseVersion":null,"currentReleaseDescription":null,"iconDesktopUrl":"https://appstream.ubuntu.com/media/noble/b/be/beneath-a-steel-sky.desktop/FB6F3FCBA88DA4E5F45947B41DEB99BD/icons/128x128/beneath-a-steel-sky_beneath-a-steel-sky.png","iconMobileUrl":"https://appstream.ubuntu.com/media/noble/b/be/beneath-a-steel-sky.desktop/FB6F3FCBA88DA4E5F45947B41DEB99BD/icons/128x128/beneath-a-steel-sky_beneath-a-steel-sky.png","screenshots":[],"currentReleaseDate":null,"inStoreSinceDate":null}