{"flatpakAppId":"denemo.desktop","name":"GNU Denemo","summary":"Edit musical scores","description":"\n    <p>Denemo is a free music notation program GUI for GNU/Linux, macOS and Windows that lets you rapidly enter notation which it typesets using the LilyPond music engraver.  Music can be typed in at the PC keyboard, or played in via MIDI controller, or input acoustically into a microphone plugged into your computer’s soundcard.</p>\n    <p>Denemo uses LilyPond which generates beautiful sheet music to the highest publishing standards.  During input Denemo displays the staffs in a simple fashion, so you can enter and edit the music efficiently.  The typesetting is done in the background while you work, and is generally flawless publication quality.  Some final tweaks can be done on the typeset score with the mouse if needed.  This represents an enormous practical improvement over the popular programs which require you to re-position colliding notation constantly as you enter the music.</p>\n    <p>Beginner to Professional: Denemo can be used for a brief student homework all the way to a full-scale opera.  Support is there for creating the widest range of notation – Tablature, Chord Charts, Fret Diagrams, Drums, transposing instruments, ossia, ottava, cue, title pages, table-of-contents, critical commentaries, footnotes quoting music, and more with LilyPond’s extensive syntax available for even more demanding uses.</p>\n  ","developerName":null,"projectLicense":null,"homepageUrl":null,"donationUrl":null,"translateUrl":null,"bugtrackerUrl":null,"helpUrl":null,"categories":[{"name":"Audio"},{"name":"AudioVideo"},{"name":"Music"},{"name":"Education"}],"downloadFlatpakRefUrl":"denemo","currentReleaseVersion":null,"currentReleaseDescription":null,"iconDesktopUrl":"http://localhost:7777/repo/appstream/x86_64/icons/128x128/denemo_denemo.png","iconMobileUrl":"http://localhost:7777/repo/appstream/x86_64/icons/128x128/denemo_denemo.png","screenshots":[],"currentReleaseDate":null,"inStoreSinceDate":null}