{"flatpakAppId":"io.github.fabiangreffrath.woof","name":"Woof!","summary":"Continuation of the Boom/MBF bloodline of Doom source ports","description":"\n    <p>\n      Woof! is a continuation of Lee Killough's Doom source port MBF\n      targeted at modern systems.\n    </p>\n    <p>\n      MBF stands for \"Marine's Best Friend\" and is widely regarded as\n      the successor of the Boom source port by TeamTNT. It serves as the\n      code base for popular Doom source ports such as PrBoom+/DSDA-Doom or\n      The Eternity Engine. As the original engine was limited to run only\n      under MS-DOS, it has been ported to Windows by Team Eternity under the\n      name WinMBF in 2004. Woof! is developed based on the WinMBF code with\n      the aim to make MBF more widely available and convenient to use on\n      modern systems.\n    </p>\n    <p>\n      To achieve this goal, this source port is less strict regarding\n      its faithfulness to the original MBF. It is focused on quality-of-life\n      enhancements, bug fixes and compatibility improvements. However, all\n      changes have been introduced in good faith that they are in line with\n      the original author's intentions and even for the trained eye, this\n      source port should still look very familiar to the original MBF.\n    </p>\n    <p>\n      In summary, this project's goal is to forward-port MBF.EXE from\n      DOS to 21st century and remove all the stumbling blocks on the way.\n      Furthermore, just as MBF was ahead of its time, this project dedicates\n      itself to early adoption of new modding features such as\n      DEHEXTRA+DSDHacked, UMAPINFO and MBF21.\n    </p>\n  ","developerName":null,"projectLicense":"GPL-2.0+","homepageUrl":"http://fabiangreffrath.github.io/woof","donationUrl":null,"translateUrl":null,"bugtrackerUrl":"https://github.com/fabiangreffrath/woof/issues","helpUrl":null,"categories":[{"name":"Game"},{"name":"ActionGame"}],"downloadFlatpakRefUrl":"woof-doom","currentReleaseVersion":"11.3.0","currentReleaseDescription":null,"iconDesktopUrl":"https://appstream.ubuntu.com/media/noble/io/github/fabiangreffrath.woof/87c70a1d709c18807dcb30ceb326a205/icons/128x128/woof-doom_woof.png","iconMobileUrl":"https://appstream.ubuntu.com/media/noble/io/github/fabiangreffrath.woof/87c70a1d709c18807dcb30ceb326a205/icons/128x128/woof-doom_woof.png","screenshots":[],"currentReleaseDate":"2023-07-06","inStoreSinceDate":null}