{"flatpakAppId":"lure-of-the-temptress.desktop","name":"Lure of the Temptress","summary":"classic 2D point and click fantasy adventure game","description":"\n    <p>Lure of the Temptress was Revolution's very first adventure game and work began on it in 1989, even before Revolution's inception as an actual games development company.</p>\n    <p>You are Diermot, an unwilling hero who'd prefer a quiet life, and are, to all intents and purposes, a good man. After decades of unrest the King has united the warring factions in his kingdom and all his lands are at peace, except a remote region around a town called Turnvale. A revolt has recently taken place in Turnvale, a revolt orchestrated by an apprentice sorceress called Selena, the titular temptress. The king calls together his finest horsemen and heads off (with you in tow) to Turnvale just to witness how hellish mercenary monsters called Skorl are invading the town.</p>\n    <p>The king's men are defeated, the king is killed and you fall of your horse and bang your head heavily on the ground. You have been unconscious for a while when you realize that you are in a dingy cell guarded by a not so friendly Skorl. Maybe it would be an idea to try and escape...</p>\n    <p>Note that this package only contains game-data. The game engine is provided by ScummVM.</p>\n  ","developerName":null,"projectLicense":null,"homepageUrl":null,"donationUrl":null,"translateUrl":null,"bugtrackerUrl":null,"helpUrl":null,"categories":[{"name":"AdventureGame"},{"name":"Game"},{"name":"RolePlaying"}],"downloadFlatpakRefUrl":"lure-of-the-temptress","currentReleaseVersion":null,"currentReleaseDescription":null,"iconDesktopUrl":"https://appstream.ubuntu.com/media/noble/l/lu/lure-of-the-temptress.desktop/58e2da9cdfe5798f44bccb4848296dbc/icons/128x128/lure-of-the-temptress_lure-of-the-temptress.png","iconMobileUrl":"https://appstream.ubuntu.com/media/noble/l/lu/lure-of-the-temptress.desktop/58e2da9cdfe5798f44bccb4848296dbc/icons/128x128/lure-of-the-temptress_lure-of-the-temptress.png","screenshots":[],"currentReleaseDate":null,"inStoreSinceDate":null}