{"flatpakAppId":"org.mirbsd.Jupp.jupp","name":"jupp, the Editor which sucks less","summary":"Edit text files, programs, …","description":"\n    <p>JOE, the Joe’s Own Editor, has the feel of most PC text editors: the key sequences are reminiscent of WordStar and Turbo C editors, but the feature set is much larger than of those.  JOE has all of the features a Unix user should expect: full use of termcap/terminfo, complete vi-style Unix integration, a powerful configuration file and a regular expression search system.  It also has eight help reference cards which are always available, and an intuitive, simple, and well thought-out user interface.</p>\n    <p>JOE has a great screen update optimisation algorithm, multiple windows (through/between which you can scroll) and lacks the confusing notion of named buffers.  It has command history, tab expansion in file selection menus, undo and redo functions, (un)indenting and paragraph formatting, filtering highlighted blocks through any external Unix command, editing a pipe into or out of a command, block move, copy, delete or filter, a bracketed paste mode automatically enabled on xterm-xfree86 and decimal and hexadecimal gotos for lines, columns, and file offsets.</p>\n    <p>Through simple QEdit-style configuration files, JOE can be set up to emulate editors such as Pico and Emacs, along with a complete imitation of WordStar in non-document mode, and a restricted mode version (lets you edit only the files specified on the command line). JOE also has a deferred screen update to handle typeahead, and it ensures that deferral is not bypassed by tty buffering. It’s usable even at 2400 baud, and it will work on any kind of sane terminal. Furthermore, it supports SELinux context copying on Debian systems with the Linux kernel.</p>\n    <p>This version of JOE only comes with the “jupp” flavour, to not conflict with the Debian joe package, activated. The resource files and executable links and menu entries for the other flavours are still available, though, in the joe-jupp package.</p>\n  ","developerName":null,"projectLicense":null,"homepageUrl":null,"donationUrl":null,"translateUrl":null,"bugtrackerUrl":null,"helpUrl":null,"categories":[{"name":"Development"},{"name":"Utility"},{"name":"TextEditor"},{"name":"ConsoleOnly"}],"downloadFlatpakRefUrl":"jupp","currentReleaseVersion":null,"currentReleaseDescription":null,"iconDesktopUrl":"http://localhost:7777/repo/appstream/x86_64/icons/128x128/jupp_jupp.png","iconMobileUrl":"http://localhost:7777/repo/appstream/x86_64/icons/128x128/jupp_jupp.png","screenshots":[],"currentReleaseDate":null,"inStoreSinceDate":null}