{"flatpakAppId":"org.kde.zanshin.desktop","name":"Zanshin","summary":"To Do Management Application","description":"\n    <p>\n      Zanshin is a powerful yet simple application for managing your day to day actions.\n      It helps you organize and reduce the cognitive pressure of what one has to do in his job and personal life.\n      You'll never forget anything anymore, getting your mind like water.\n    </p>\n    <p>Collect</p>\n    <p>Worried about forgetting something? Unexpected memory losses? Zanshin is here to help you. You can collect your tasks and free your mind. You will soon stop hearing this voice nagging you about what you probably forgot, or what you should do. Just fire up Zanshin, once something is collected, you are sure to find it there.</p>\n    <p>Organize</p>\n    <p>Zanshin makes it simple to put your daily life in order. Just create a few projects, a few contexts and start filling them with tasks. You can simply do this using drag and drop. Something has to be done before a given day? Just set a due date and it'll stand out from your other items. You need to work on a project? Focus on it and you will see all the related tasks. Feeling like dealing with your phone calls? Focus on your phone context to find all the pending calls you have to give.</p>\n    <p>Optimize</p>\n    <p>We hackers love our keyboards, and you probably find yourself more efficient with your hands on the keyboard as much as possible. That's why we crafted Zanshin carefully to be completely drivable from the keyboard. We added shortcuts to add tasks, move them to a project or a context, navigate, etc.</p>\n    <p>Integrate</p>\n    <p>Zanshin is an application of the KDE community, as such it unleashes even more power when used with other KDE Applications or within KDE Plasma Desktop. Using KMail? You can create a task right from an email you received and it'll appear in Zanshin's Inbox. Using KOrganizer? All your overdue and coming task will appear in the calendar view. Using Plasma Desktop? Then you can collect from anywhere using KRunner, just type in \"todo: Buy apples\", and you will find that tasks in Zanshin's Inbox, even if it wasn't running!</p>\n  ","developerName":null,"projectLicense":"GPL-3.0+","homepageUrl":"http://apps.kde.org/zanshin","donationUrl":null,"translateUrl":null,"bugtrackerUrl":"https://bugs.kde.org/enter_bug.cgi?format=guided&product=zanshin","helpUrl":null,"categories":[{"name":"Utility"}],"downloadFlatpakRefUrl":"zanshin","currentReleaseVersion":"23.08.3","currentReleaseDescription":null,"iconDesktopUrl":"https://appstream.ubuntu.com/media/noble/org/kde/zanshin.desktop/bf3eaff94c80aaa1494d391adb1bdbbd/icons/128x128/zanshin_zanshin.png","iconMobileUrl":"https://appstream.ubuntu.com/media/noble/org/kde/zanshin.desktop/bf3eaff94c80aaa1494d391adb1bdbbd/icons/128x128/zanshin_zanshin.png","screenshots":[{"thumbUrl":"https://appstream.ubuntu.com/media/noble/org/kde/zanshin.desktop/bf3eaff94c80aaa1494d391adb1bdbbd/screenshots/image-1_224x149.png","imgMobileUrl":"https://appstream.ubuntu.com/media/noble/org/kde/zanshin.desktop/bf3eaff94c80aaa1494d391adb1bdbbd/screenshots/image-1_1248x832.png","imgDesktopUrl":"https://appstream.ubuntu.com/media/noble/org/kde/zanshin.desktop/bf3eaff94c80aaa1494d391adb1bdbbd/screenshots/image-1_orig.png"}],"currentReleaseDate":"2023-11-09","inStoreSinceDate":null}