{"flatpakAppId":"org.gnu.pspp","name":"GNU PSPP","summary":"GNU PSPP is a program for statistical analysis of sampled data","description":"\n    <p>GNU PSPP is a program for the statistical analysis of sampled data. It is a Free replacement for the proprietary program SPSS, and appears very similar to it with a few exceptions. The most important of these exceptions are, that there are no “time bombs”; your copy of PSPP will not “expire” or deliberately stop working in the future. Neither are there any artificial limits on the number of cases or variables which you can use. There are no additional packages to purchase in order to get “advanced” functions; all functionality that PSPP currently supports is in the core package.</p>\n    <p>PSPP is a stable and reliable application. It can perform descriptive statistics, T-tests, anova, linear and logistic regression, measures of association, cluster analysis, reliability and factor analysis, non-parametric tests and more. Its backend is designed to perform its analyses as fast as possible, regardless of the size of the input data. You can use PSPP with its graphical interface or the more traditional syntax commands.</p>\n    <p>A brief list of some of PSPP's features.</p>\n    <ul>\n      <li>Support for over 1 billion cases</li>\n      <li>Support for over 1 billion variables</li>\n      <li>Syntax and data files which are compatible with those of SPSS</li>\n      <li>A choice of terminal or graphical user interface</li>\n      <li>A choice of text, postscript, pdf, opendocument, html or TeX output formats</li>\n      <li>Inter-operability with: LibreOffice, Apache OpenOffice, Gnumeric and other free software</li>\n      <li>Easy data import from spreadsheets, text files and database sources</li>\n      <li>The capability to open, analyse and edit two or more datasets concurrently</li>\n      <li>A user interface supporting all common character sets</li>\n      <li>The user interface has been translated to multiple languages</li>\n      <li>Very fast statistical procedures, even on very large data sets</li>\n      <li>No license fees and no expiration period</li>\n      <li>No unethical “end user license agreements”</li>\n      <li>A fully indexed user manual</li>\n      <li>Freedom ensured; It is licensed under the GPLv3 or later</li>\n      <li>Portability; Runs on many different computers and many different operating systems</li>\n    </ul>\n    <p>PSPP is particularly aimed at statisticians, social scientists and students requiring fast convenient analysis of sampled data.</p>\n  ","developerName":null,"projectLicense":"GPL-3.0+","homepageUrl":"https://www.gnu.org/software/pspp/","donationUrl":"https://my.fsf.org/donate","translateUrl":"https://translationproject.org/domain/pspp.html","bugtrackerUrl":"https://savannah.gnu.org/bugs/?func=additem&group=pspp","helpUrl":"https://www.gnu.org/software/pspp/manual/html_node/index.html","categories":[{"name":"Science"},{"name":"Math"},{"name":"NumericalAnalysis"},{"name":"GTK"}],"downloadFlatpakRefUrl":"pspp","currentReleaseVersion":"1.6.2","currentReleaseDescription":null,"iconDesktopUrl":"https://appstream.ubuntu.com/media/noble/org/gnu/pspp/654db057ed238ed78a99eafb15012dd3/icons/128x128/pspp_org.gnu.pspp.png","iconMobileUrl":"https://appstream.ubuntu.com/media/noble/org/gnu/pspp/654db057ed238ed78a99eafb15012dd3/icons/128x128/pspp_org.gnu.pspp.png","screenshots":[{"thumbUrl":"https://appstream.ubuntu.com/media/noble/org/gnu/pspp/654db057ed238ed78a99eafb15012dd3/screenshots/image-1_224x150.png","imgMobileUrl":"https://appstream.ubuntu.com/media/noble/org/gnu/pspp/654db057ed238ed78a99eafb15012dd3/screenshots/image-1_752x505.png","imgDesktopUrl":"https://appstream.ubuntu.com/media/noble/org/gnu/pspp/654db057ed238ed78a99eafb15012dd3/screenshots/image-1_orig.png"}],"currentReleaseDate":"2022-07-01","inStoreSinceDate":null}