{"flatpakAppId":"org.aegisub.desktop","name":"Aegisub","summary":"A free, cross-platform open source tool for creating and modifying subtitles","description":"\n    <p>Aegisub is a free, cross-platform open source tool for creating and modifying subtitles. Aegisub makes it quick and easy to time subtitles to audio, and features many powerful tools for styling them, including a built-in real-time video preview.</p>\n    <p>Aegisub was originally created as a tool to make typesetting, particularly in anime fansubs, a less painful experience. At the time of the start of the project, many other programs that supported the Advanced Substation Alpha format lacked (and in many cases, still lack; development on several competing programs have since been dropped for various reasons completely unrelated to Aegisub) many vital functions, or were too buggy and/or unreliable to be really useful.</p>\n    <p>Since then, Aegisub has grown into a fully fledged, highly customizable subtitle editor. It features a lot of convenient tools to help you with timing, typesetting, editing and translating subtitles, as well as a powerful scripting environment called Automation (originally mostly intended for creating karaoke effects, Automation can now be used much else, including creating macros and various other convenient tools).</p>\n    <p>Some highlights of Aegisub:</p>\n    <ul>\n      <li>Simple and intuitive yet powerful interface for editing subtitles</li>\n      <li>Support for many formats and character sets</li>\n      <li>Powerful video mode</li>\n      <li>Visual typesetting tools</li>\n      <li>Intuitive and customizable audio timing mode</li>\n      <li>Fully scriptable through the Automation module</li>\n    </ul>\n  ","developerName":null,"projectLicense":"BSD-3-Clause AND MIT AND MPL-1.1","homepageUrl":"http://www.aegisub.org","donationUrl":null,"translateUrl":"https://sites.google.com/site/rockytdrontransifex/aegisub","bugtrackerUrl":"https://github.com/Aegisub/Aegisub/issues","helpUrl":"http://docs.aegisub.org","categories":[{"name":"AudioVideo"},{"name":"AudioVideoEditing"}],"downloadFlatpakRefUrl":"aegisub","currentReleaseVersion":"3.2.2","currentReleaseDescription":null,"iconDesktopUrl":"https://appstream.ubuntu.com/media/noble/org/aegisub/desktop/d8d0bf918fa280d7c1d4d40c4a454126/icons/128x128/aegisub_aegisub.png","iconMobileUrl":"https://appstream.ubuntu.com/media/noble/org/aegisub/desktop/d8d0bf918fa280d7c1d4d40c4a454126/icons/128x128/aegisub_aegisub.png","screenshots":[],"currentReleaseDate":"2014-12-08","inStoreSinceDate":null}