{"flatpakAppId":"syncplay.desktop","name":"Syncplay","summary":"Synchronize video playback over network","description":"\n    <p>Allows you to watch movies with friends or family at different places synchronized via the internet.</p>\n    <p>When a viewer pauses/continues playback or seeks within their media player this will be replicated across all media players connected to the same server in the same viewing session. A chat function is included so viewers can discuss the movie while watching it. To improve the communication experience for viewers, the Syncplay developers and therefore the syncplay-client package suggest to use additional VoIP software (package mumble) or video phone software (packages jami or linphone-desktop).</p>\n    <p>Technically, it synchronizes the position and play states of multiple mpv, VLC, MPC-HC and MPC-BEmedia player instances so viewers' players present the same movie at the same time.</p>\n    <p>In case your friends and family do not use Debian, Syncplay is available for other operating systems on the upstream website. To learn what Syncplay is read the description of package 'syncplay'.</p>\n    <p>This package installs the graphical desktop client program that does the actual synchronization of your video player. Therefore it must connect to a Syncplay server.</p>\n  ","developerName":null,"projectLicense":null,"homepageUrl":null,"donationUrl":null,"translateUrl":null,"bugtrackerUrl":null,"helpUrl":null,"categories":[{"name":"AudioVideo"},{"name":"Audio"},{"name":"Video"}],"downloadFlatpakRefUrl":"syncplay","currentReleaseVersion":null,"currentReleaseDescription":null,"iconDesktopUrl":"https://appstream.ubuntu.com/media/noble-updates/s/sy/syncplay.desktop/a1ab820f184d62dc48315b107313bf54/icons/128x128/syncplay_syncplay.png","iconMobileUrl":"https://appstream.ubuntu.com/media/noble-updates/s/sy/syncplay.desktop/a1ab820f184d62dc48315b107313bf54/icons/128x128/syncplay_syncplay.png","screenshots":[],"currentReleaseDate":null,"inStoreSinceDate":null}